#+TODO: TODO(t) STARTED(s) TESTING(c) | DONE(d)

* In Progress

** Break
   :LOGBOOK:
   CLOCK: [2017-10-04 Wed 10:29]--[2017-10-04 Wed 10:47] =>  0:18
   :END:

** ~geco_gwpy_dump~ improvements

*** STARTED Add segment lists to output file list
    :LOGBOOK:
    CLOCK: [2017-10-04 Wed 17:55]--[2017-10-04 Wed 21:30] =>  3:35
    :END:

    Segment lists are used to figure out which time segments were good for
    the detector. These should be considered output files to prevent redundant
    downloading when unpacking an archived job. Since they are necessary for
    any work involving a jobspec file anyway, you want to know whether they
    are there, and it is thus important to list their status when the -o flag
    is given. It is also therefore important to include them in the archive,
    so that later data analysis can be performed offline.

** STARTED Fix incorrect Cesium plot

   Used the wrong channel: ~H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_2~
   is incorrect for LHO Cesium; use
   ~H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_1~ instead.

#+NAME: Keita slow channel plot comment
#+BEGIN_SRC
...
you are analyzing H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_2, which
is NTP comparator channel and not the atomic clock. That's why your offset
as well as linear drift is very small. Real atomic clock comparison should
look like the LLO data.

The correct channel to analyze is
H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_1.
...
A minor point related to the above is that the diagnostic channel plots like
https://dcc.ligo.org/DocDB/0145/T1700441/001/G297595-
diagnostic-channel-plot-comparison.pdf
should include corner station comparator A channels like
L1:SYS-TIMING_C_PPS_A_SIGNAL_1_DIFF both for LLO and LHO. Corner station
comparator B channels are not connected to anything.
...
#+END_SRC

*** DONE Plan
    CLOSED: [2017-10-03 Tue 13:56]
    :LOGBOOK:
    CLOCK: [2017-10-03 Tue 12:41]--[2017-10-03 Tue 13:55] =>  1:14
    :END:

*** DONE Update jobspec
    CLOSED: [2017-10-03 Tue 13:59]
    :LOGBOOK:
    CLOCK: [2017-10-03 Tue 13:56]--[2017-10-03 Tue 13:59] =>  0:03
    :END:

**** DONE Change in channels
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Change in channel descriptions
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Change in plots
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Reset plot properties to blank
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Update git repo
     CLOSED: [2017-10-03 Tue 13:59]

*** DONE Start download on ligodl
    CLOSED: [2017-10-03 Tue 14:09]
    :LOGBOOK:
    CLOCK: [2017-10-04 Wed 09:53]--[2017-10-04 Wed 09:53] =>  0:00
    CLOCK: [2017-10-03 Tue 13:59]--[2017-10-03 Tue 14:09] =>  0:10
    :END:

    Start downloading the missing channel on my data download server.

    Finished, less than 24 hours for a single channel.

*** DONE Add utils for easily moving output files around
    CLOSED: [2017-10-04 Wed 16:32]

**** DONE Plan
     CLOSED: [2017-10-04 Wed 09:57]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 09:57]--[2017-10-04 Wed 09:57] =>  0:00
     :END:
**** DONE Add function for getting sha256 sum of out filenames
     CLOSED: [2017-10-04 Wed 16:31]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 09:57]--[2017-10-04 Wed 10:02] =>  0:05
     :END:
     [[https://stackoverflow.com/questions/26538588/how-to-sha256-hash-a-variable-in-python][Explanation here.]]
**** DONE Add function for getting archive filename
     CLOSED: [2017-10-04 Wed 16:31]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:02]--[2017-10-04 Wed 10:05] =>  0:03
     :END:
**** DONE Add function for archiving
     CLOSED: [2017-10-04 Wed 16:31]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:05]--[2017-10-04 Wed 10:15] =>  0:10
     :END:
     [[https://stackoverflow.com/questions/3874837/how-do-i-compress-a-folder-with-the-python-gzip-module][Explanation here.]]
**** DONE Add function for unarchiving
     CLOSED: [2017-10-04 Wed 16:31]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:15]--[2017-10-04 Wed 10:26] =>  0:11
     :END:
     [[https://stackoverflow.com/questions/30887979/i-want-to-create-a-script-for-unzip-tar-gz-file-via-python][Explanation here.]]
**** DONE Add flags
     CLOSED: [2017-10-04 Wed 16:31]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:47]--[2017-10-04 Wed 10:55] =>  0:08
     :END:
***** DONE Add -a option for archiving
      CLOSED: [2017-10-04 Wed 16:31]
***** DONE Add -u option for unarchiving
      CLOSED: [2017-10-04 Wed 16:31]
***** DONE Add -f option to print archive filename
      CLOSED: [2017-10-04 Wed 16:31]
**** DONE Update help string with new flags
     CLOSED: [2017-10-04 Wed 16:31]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:55]--[2017-10-04 Wed 10:59] =>  0:04
     :END:

*** DONE Add a copy of the jobspec file to the archive
    CLOSED: [2017-10-04 Wed 16:32]
    :LOGBOOK:
    CLOCK: [2017-10-04 Wed 15:22]--[2017-10-04 Wed 16:32] =>  1:10
    CLOCK: [2017-10-04 Wed 11:00]--[2017-10-04 Wed 11:00] =>  0:00
    :END:

**** DONE Add a copy of the jobspec JSON file to every archive
     CLOSED: [2017-10-04 Wed 16:31]
**** DONE Add a function that unarchives an entire job, including spec
     CLOSED: [2017-10-04 Wed 16:31]
**** DONE Add -x flag to fully extract a jobspec and its output files
     CLOSED: [2017-10-04 Wed 16:31]
**** DONE Add -X flag, same as -x but without filename checks
     CLOSED: [2017-10-04 Wed 16:32]
**** DONE Add documentation on -x flag to help string
     CLOSED: [2017-10-04 Wed 16:23]
**** DONE Add documentation on -X flag to help string
     CLOSED: [2017-10-04 Wed 16:23]
**** DONE Mention in docs that multiple flags are not officially supported
     CLOSED: [2017-10-04 Wed 16:24]

*** DONE Resolve symlinks before archiving
    CLOSED: [2017-10-04 Wed 17:08]

    Do this using ~os.path.realpath~ for all cases.

**** DONE Resolve symlinks for output files
     CLOSED: [2017-10-04 Wed 17:07]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 16:48]--[2017-10-04 Wed 17:07] =>  0:19
     :END:
**** DONE Resolve symlinks for jobspec file
     CLOSED: [2017-10-04 Wed 17:07]

*** DONE Copy output files to ldas-pcdev2
    CLOSED: [2017-10-04 Wed 17:17]
    :LOGBOOK:
    CLOCK: [2017-10-04 Wed 17:08]--[2017-10-04 Wed 17:17] =>  0:09
    CLOCK: [2017-10-04 Wed 16:35]--[2017-10-04 Wed 16:48] =>  0:13
    :END:

    Also back up files to ~research/archive/slow-channel-dumps~.

*** DONE Generate plots
    CLOSED: [2017-10-05 Thu 15:59]
    :LOGBOOK:
    CLOCK: [2017-10-04 Wed 17:18]--[2017-10-04 Wed 23:53] =>  6:35
    :END:

    This took way too long and made way too many zoom plots. It also forced
    the downloading of thousands of files and more than doubled storage used.
    This is because the LHO Cesium clock was outside of the default anomaly
    window for most of the run. Just about every anomaly was a plain old
    outlier.

    Adding a new TODO item to fix this now.

*** DONE Add a CLI to ~geco_slow_channel_plot~
    CLOSED: [2017-10-05 Thu 15:59]

    To be honest, a good amount of this was already done in another branch.

*** DONE Diagnose faults
    CLOSED: [2017-10-05 Thu 16:01]
*** DONE Update Cesium document
    CLOSED: [2017-10-05 Thu 16:52]
    :LOGBOOK:
    CLOCK: [2017-10-05 Thu 16:04]--[2017-10-05 Thu 16:52] =>  0:48
    :END:

**** DONE Describe faults
     CLOSED: [2017-10-05 Thu 16:04]

     Fortunately there were no faults. Only a spurious missing time at
     hanford segment 218, as with the other channels.

**** DONE Update metrics on LHO performance
     CLOSED: [2017-10-05 Thu 16:50]
**** DONE Update conclusion
     CLOSED: [2017-10-05 Thu 16:50]

     No longer need to say that LHO's superior performance is worth
     investigating because apparently it isn't superior after all. Somewhat
     better calibrated, but not qualitatively so. Similar order of
     magnitude drift.

**** DONE Update plots in Cesium document
     CLOSED: [2017-10-05 Thu 16:52]

*** DONE Send updated file to Zsuzsa
    CLOSED: [2017-10-05 Thu 17:02]
*** TODO Re-upload to DCC
  

    Waiting on Zsuzsa's okay.

**** STARTED Wait on Zsuzsa's clearance

*** DONE Update ~geco_slow_channel_plot~ documentation
    CLOSED: [2017-10-05 Thu 17:28]
    :LOGBOOK:
    CLOCK: [2017-10-05 Thu 17:03]--[2017-10-05 Thu 17:28] =>  0:25
    :END:

    Add a line about double checking with people on site.

#+NAME: zsuzsa email
#+BEGIN_SRC
First of all, put in first line that get in touch with Keith and Dave at
the sites to make sure that no cables were switched...
#+END_SRC

* Done
